Revit 2027 API
IFCLinkPosition Enumeration
 IFC Link Position within the Host Document.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum IFCLinkPosition
Public Enumeration IFCLinkPosition
public enum class IFCLinkPosition
type IFCLinkPosition
Members
Member name | Value | Description
InternalOrigin | 0 |  Link IFC Origin to Revit Internal Origin.
ProjectBasePoint | 1 |  Link IFC Origin to Project Base Point.
SurveyPoint | 2 |  Link IFC Origin to Survey Point.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace